In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'COL1':[1,2,3,4],'COL2':[444,555,666,444],'COL3':['abc','def','ghi','xyz']})
df.head()

   COL1  COL2 COL3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

- Método que retorna valores únicos(sem as repetições possiveis) de uma coluna

In [7]:
df['COL2'].unique()

array([444, 555, 666])

- Usando o unique do numpy

In [9]:
np.unique(df['COL2'])

array([444, 555, 666])

- Para ver o tamanho desse vetor retornado, existem três opções
- A primeira é uma adptação
- A segunda é um método do pd

In [10]:
len(df['COL2'].unique())

3

In [11]:
df['COL2'].nunique()

3

- Retornar quais dados estão na coluna e quantas vezes se repetem

In [12]:
df['COL2'].value_counts()

444    2
555    1
666    1
Name: COL2, dtype: int64

### Seleção
- Selecionar dados no DF

In [13]:
df[df['COL1']>2]

   COL1  COL2 COL3
2     3   666  ghi
3     4   444  xyz

In [14]:
df[(df['COL1']>2) & (df['COL2']==444)]

   COL1  COL2 COL3
3     4   444  xyz

### Aplicando funções em um DF
- A função é aplicada em todos os elementos definidos 
- Uso do apply, parecido com o map
- O argumento do apply é a função desejada

In [16]:
def quadrado(x):
    return x*x

In [20]:
df['COL1'].apply(quadrado)

0     1
1     4
2     9
3    16
Name: COL1, dtype: int64

- Utilizando o lambda, para elevar ao cubo

In [21]:
df['COL1'].apply(lambda x: x*x*x,)

0     1
1     8
2    27
3    64
Name: COL1, dtype: int64

- deletar colunas, função do python

In [22]:
del df['COL2']

In [25]:
df

   COL1 COL3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [26]:
df['COL2'] = [444,555,666,444]

In [27]:
df

   COL1 COL3  COL2
0     1  abc   444
1     2  def   555
2     3  ghi   666
3     4  xyz   444

-  **Ordenar valores**

In [29]:
df.sort_values(by='COL2', inplace=True)

In [30]:
df

   COL1 COL3  COL2
0     1  abc   444
3     4  xyz   444
1     2  def   555
2     3  ghi   666

- Visualizar o index do DF, parametro do obejto

In [32]:
df.index

Int64Index([0, 3, 1, 2], dtype='int64')

In [35]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

- Mostra uma tabela bool das posições null

In [34]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

- apaga a linha ou a coluna de valores nulos

In [46]:
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [41]:
df.dropna(axis=1)

  col3
0  abc
1  def
2  ghi
3  xyz

- Preenche a coluna no espaço delimitado com algum dado desejado

In [44]:
df['col1'].fillna(df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [47]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [48]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

- Reajustar os dados do DF, criando até multiniveis. facilitando enxergar os dados
- **pivot_table**

In [50]:
df.pivot_table(values='C',index=['A','B'],columns='D')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN